In [1]:
import pandas as pd

In [2]:
#create dataframe with pandas
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1, 2, 3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [16]:
#column 'a'
df['a']

n  v
d  1    4
   2    5
e  2    6
Name: a, dtype: int64

In [6]:
#row '1'
df.loc[1]

a     4
b     7
c    10
Name: 1, dtype: int64

In [8]:
#row 1, column 'a'
df.loc[1,"a"]

4

In [9]:
#row 1, 2, column 'a', 'c'
df.loc[[1, 2],["a", "c"]]

   a   c
1  4  10
2  5  11

In [11]:
#create dataframe with pandas
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [17]:
#multi indexing
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6],
    "b" : [7, 8, 9, 9],
    "c" : [10, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',1),('e',2)],
    names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12
  2  6  9  12

In [13]:
#원하는 조건의 값만 빼오기
df.b > 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [14]:
#원하는 조건의 값만 빼오기
df[df.a < 5]

     a  b   c
n v
d 1  4  7  10

In [22]:
#중복 제거
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12

In [26]:
#맨 위 2개의 행
df.head(2)

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [28]:
#맨 아래 1개의 행
df.tail(1)

     a  b   c
n v
e 2  6  9  12

In [39]:
#75%의 갯수 해당하는 행 
df.sample(frac=0.75)

     a  b   c
n v
e 2  6  9  12
  1  6  9  12
d 2  5  8  11

In [40]:
#임의의 행 3개
df.sample(3)

     a  b   c
n v
d 1  4  7  10
e 1  6  9  12
  2  6  9  12

In [46]:
#행 인덱싱
df.iloc[1:2]

     a  b   c
n v
d 2  5  8  11

In [55]:
#행 인덱싱
df.iloc[1:4]

     a  b   c
n v
d 2  5  8  11
e 1  6  9  12
  2  6  9  12

In [57]:
#'a'열 기준 가장 큰 값 2개의 행
df.nlargest(2, 'a')

     a  b   c
n v
e 1  6  9  12
  2  6  9  12

In [58]:
#'c'열 기준 가장 작은 값 1개의 행
df.nsmallest(1, 'c')

     a  b   c
n v
d 1  4  7  10

In [60]:
#'b', 'c'열
df[['b', 'c']]

     b   c
n v
d 1  7  10
  2  8  11
e 1  9  12
  2  9  12

In [70]:
#행의 이름 첫 시작이 'a'인 행
df.filter(regex='^a')

     a
n v
d 1  4
  2  5
e 1  6
  2  6